# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 4  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.5  # layer channel multiple
backbonedn: 10
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backboned:
  # input 3*640*640
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2     args[ch_in, ch_out, kernel, stride, padding, groups]
   # 64*320*320
   [-1, 1, Conv, [128, 3, 2]],  # 1
   # 128*160*160
   [-1, 3, C3, [128]],  # 2
   # 128*160*160
   [-1, 1, Conv, [256, 3, 2]],  # 3
   # 256*80*80
   [-1, 6, C3, [256]],  # 4
   # 256*80*80
   [-1, 1, Conv, [512, 3, 2]],  # 5
   # 512*40*40
   [-1, 3, C3, [512]],  # 6
   # 512*40*40
   [ -1, 1, Conv, [ 1024, 3, 2 ] ],  # 7
    # 1024*20*20
   [ -1, 9, C3, [ 1024 ] ],  # 8
    # 1024*20*20
   [ -1, 1, SPPF, [ 1024, 5 ] ],  # 9
    # 1024*20*20
  ]

backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 10-P1/2
   # 64*320*320
   [-1, 1, Conv, [128, 3, 2]],  # 11
   # 128*160*160
   [-1, 3, C3, [128]],  # 12
   # 128*160*160
   [-1, 1, Conv, [256, 3, 2]],  # 13
   # 256*80*80
   [-1, 6, C3, [256]],  # 14
   # 256*80*80
   [-1, 1, Conv, [512, 3, 2]],  # 15
   # 512*40*40
   [-1, 3, C3, [512]],  # 16
   # 512*40*40
   [[-1, 6], 1, ConcatSc, [256, 512, 256]],  # 17
   # 1024*40*40
   [-1, 1, Conv, [1024, 3, 2]],  # 18
   # 1024*20*20
   [-1, 9, C3, [1024]],  # 19
   # 1024*20*20
   [[-1, 8], 1, ConcatSc, [512, 1024, 512]],  # 20
   # 2048*40*40
   [-1, 1, SPPF, [1024, 5]],  # 21
   # 1024*20*20
   [[-1, 9], 1, ConcatSc, [512, 1024, 512]],  # 22
   # 2048*20*20
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],  # 23
   # 512*20*20
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 24
   # 512*40*40
   [[-1, 16], 1, Concat, [1]],  # cat backbone P4  25
   # 1024*40*40
   [-1, 1, C3, [512, False]],  # 26
   # 512*40*40

   [-1, 1, Conv, [256, 1, 1]],  # 27
   # 256*40*40
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 28
   # 256*80*80
   [[-1, 14], 1, Concat, [1]],  # cat backbone P3 29
   # 512*80*80
   [-1, 1, C3, [256, False]],  # 30 (P3/8-small)
   # 256*80*80

   [-1, 1, Conv, [256, 3, 2]],  # 31
   # 256*40*40
   [[-1, 27], 1, Concat, [1]],  # cat head P4  32
   # 512*40*40
   [-1, 1, C3, [512, False]],  # 33 (P4/16-medium)
   # 512*40*40

   [-1, 1, Conv, [512, 3, 2]],  # 34
   # 512*20*20
   [[-1, 23], 1, Concat, [1]],  # cat head P5  35
   # 1024*20*20
   [-1, 1, C3, [1024, False]],  # 36 (P5/32-large)
   # 1024*20*20

   [[30, 33, 36], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)  37
  ]