# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 1  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
backbonedn: 2
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backboned:
  # input 3*640*640
  # [from, number, module, args]
  [[-1, 1, Conv, [8, 3, 1, 1]],  # 0-P1/2  0   args[ch_in, ch_out, kernel, stride, padding, groups]
   #640*640*8
   [-1, 3, C3, [8]],  # 1
  ]

backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [8, 3, 1, 1]],  #2 0-P1/2
   [-1, 3, C3, [8]],  # 3
   [[-1, 1], 1, Concatd, [16,1]],  # 4
   #640*640*16
   [-1, 3, C3, [32]],  # 5
   [-1, 1, Conv, [64, 3, 2]],  # 6
   #320*320*32
   [-1, 3, C3, [64]],  # 7
   [-1, 1, Conv, [128, 3, 2]],  # 8
   [-1, 3, C3, [128]],  # 9
   #160*160*64
   [-1, 1, Conv, [256, 3, 2]],  # 10
   #80*80*128
   [-1, 9, C3, [256]],  # 11
   #80*80*128
   [-1, 1, SPPF, [256, 5]],  #12
   #80*80*128
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [128, 1, 1]], # 80*80*64  13
   [-1, 1, BiLevelRoutingAttention, []],  # 14
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 160*160*64  15
   [[-1, 9], 1, Concat, [1]],  # cat backbone P3 160*160*128  16
   [-1, 1, C3, [128, False]],  # (P3/8-small)  160*160*64  17

   [ -1, 1, Conv, [ 256, 3, 2 ] ],  # 18
   [-1, 1, BiLevelRoutingAttention, []],  # 19
   [ [ -1, 11 ], 1, Concat, [ 1 ] ],  # 20
   [ -1, 3, C3, [ 512, False ] ],  # 21

   [ -1, 1, Conv, [ 512, 3, 2 ] ],  # 22
   [-1, 1, BiLevelRoutingAttention, []],  # 23
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 160*160*64  24
   [ [ -1, 13 ], 1, Concat, [ 1 ] ],  # 25
   [ -1, 3, C3, [ 1024, False ] ],  # 26

   [[17, 21, 26], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
